{
  "meta_hinweis_oben": "WICHTIG: Am Ende der Datei steht der Marker [ENDE DER DATEI]. Wenn er nicht erscheint, ist die Datei unvollständig geladen.",
  "module": "nutritionOS",
  "submodule": "routing",
  "version": "0.9.0",
  "part_of": "MetaMemoryWorks",
  "author": "Johannes Glaser",
  "license": "MMW-Personal License v1",
  "schema": "nutritionOS_routing_v1",
  "beschreibung": "Routing-Logik für nutritionOS. Definiert, wie Nutzereingaben grob klassifiziert werden (z. B. Logging, Analyse, Rezeptwunsch, allgemeine Beratung) und welche Folgeaktionen daraufhin ausgeführt werden sollen. Diese Datei enthält keine Ernährungsdaten.",
  "meta": {
    "datenfrei": true,
    "hinweis": "Diese Datei beschreibt nur die Zuordnung von Eingaben zu Funktionen von nutritionOS. Sie speichert selbst keine Logs oder Rezepte."
  },
  "intentionen": {
    "beschreibung": "Übersicht der Haupt-Intentionstypen, die nutritionOS unterscheiden soll.",
    "typen": [
      {
        "id": "LOG_NEUER_TAG",
        "name": "Neuer Tageslog",
        "beschreibung": "Der Nutzer beschreibt, was an einem konkreten Tag gegessen wurde oder gegessen werden soll.",
        "indikatoren": [
          "Expliziter Bezug auf einen Tag (heute, gestern, Datum) und Auflistung von Lebensmitteln oder Mahlzeiten.",
          "Formulierungen wie 'heute gegessen', 'für [Datum] habe ich gegessen', oder 'bitte als Tageslog erfassen'."
        ],
        "zielaktion": [
          "1) Eingaben strukturiert in Lebensmittel/Mahlzeiten zerlegen.",
          "2) Tagesbilanz (kcal, Makros, Pflanzenvielfalt, Obst/Gemüseportionen) berechnen.",
          "3) Einen neuen Eintrag im Ernährungslog (ernaehrungslog.json) vorbereiten.",
          "4) Vor dem Schreiben kurz zusammenfassen und Bestätigung einholen."
        ]
      },
      {
        "id": "LOG_ERGAENZUNG",
        "name": "Ergänzung zu bestehendem Tag",
        "beschreibung": "Der Nutzer ergänzt zu einem bereits begonnenen Tag weitere Lebensmittel oder Mahlzeiten.",
        "indikatoren": [
          "Bezug auf einen bereits bekannten Tag ('zu heute noch', 'ich habe später noch gegessen').",
          "Keine komplett neue Tagesaufzählung, sondern klar als Ergänzung formuliert."
        ],
        "zielaktion": [
          "1) Prüfen, auf welches Datum sich die Ergänzung bezieht.",
          "2) Lebensmittel/Mahlzeiten erfassen und Nährwerte berechnen.",
          "3) Im bestehenden Tageslog-Eintrag ergänzen – sofern die Logstruktur das vorsieht.",
          "4) Neue Bilanz berechnen und dem Nutzer kurz mitteilen."
        ]
      },
      {
        "id": "ANALYSE_TAG",
        "name": "Analyse eines Tages",
        "beschreibung": "Der Nutzer möchte wissen, wie ein bestimmter Tag ernährungsseitig bewertet wird.",
        "indikatoren": [
          "Fragen wie 'Wie sieht der Tag aus?', 'War das im Zielbereich?', 'Wie waren Makros und Kalorien?'.",
          "Bezug auf ein Datum oder 'heute'/'gestern', ohne neue Lebensmittel zu nennen."
        ],
        "zielaktion": [
          "1) Den passenden Tageslog-Eintrag im Ernährungslog finden.",
          "2) Bilanz, Makrostruktur, Obst/Gemüse-Anteil und Pflanzenvielfalt auswerten.",
          "3) Eine verständliche, knappe Einschätzung geben.",
          "4) Auf Wunsch des Nutzers konkrete Optimierungsideen anbieten."
        ]
      },
      {
        "id": "ANALYSE_ZEITRAUM",
        "name": "Analyse eines Zeitraums",
        "beschreibung": "Der Nutzer fragt nach Trends über mehrere Tage oder Wochen.",
        "indikatoren": [
          "Fragen wie 'Wie war meine Ernährung in den letzten Wochen?', 'Esse ich dauerhaft zu wenig oder zu viel?'.",
          "Bezug auf einen Zeitraum (z. B. letzte Woche, letzter Monat)."
        ],
        "zielaktion": [
          "1) Relevante Tage im Ernährungslog auswählen.",
          "2) Durchschnittswerte, Varianz und Muster (z. B. häufiges Unter- oder Überessen) berechnen.",
          "3) Obst/Gemüse-Anteil und Pflanzenvielfalt über den Zeitraum betrachten.",
          "4) Die wichtigsten Beobachtungen in wenigen, klaren Punkten zusammenfassen."
        ]
      },
      {
        "id": "REZEPT_AUS_VORRAT",
        "name": "Rezept aus vorhandenen Lebensmitteln",
        "beschreibung": "Der Nutzer nennt vorhandene Lebensmittel und möchte ein Rezept daraus.",
        "indikatoren": [
          "Aufzählung aktueller Vorräte oder Kücheninhalte, verbunden mit einem Rezeptwunsch.",
          "Formulierungen wie 'Ich habe X, Y, Z da – was kann ich daraus kochen?'."
        ],
        "zielaktion": [
          "1) Die genannten Lebensmittel als Basis verwenden, Pantry-Einträge optional berücksichtigen.",
          "2) Ein alltagstaugliches Rezept mit klaren Mengenangaben erzeugen.",
          "3) In den Schritten alle Mengen explizit wiederholen.",
          "4) Nährwerte pro Portion berechnen oder schätzen und als solche kommunizieren.",
          "5) Bei Gefallen anbieten, das Rezept in rezepte.json abzulegen."
        ]
      },
      {
        "id": "REZEPT_IDEE",
        "name": "Rezeptidee ohne festen Vorrat",
        "beschreibung": "Der Nutzer möchte Rezeptideen, ohne seine Vorräte im Detail vorzugeben.",
        "indikatoren": [
          "Fragen wie 'Hast du eine Idee für ein gesundes Gericht?' oder 'Mach mir eine passende Mahlzeit zu meinem Ziel'.",
          "Kein oder nur sehr vager Bezug auf vorhandene Lebensmittel."
        ],
        "zielaktion": [
          "1) Die Angaben aus user.json (Ernährungsform, Allergien, Ziele) berücksichtigen.",
          "2) Ein Rezept mit überschaubarer Zutatenliste und klaren Mengenangaben vorschlagen.",
          "3) Hinweis geben, welche Zutaten eingekauft werden müssten.",
          "4) Optional anbieten, das Rezept in rezepte.json zu speichern."
        ]
      },
      {
        "id": "BERATUNG_ALLGEMEIN",
        "name": "Allgemeine Ernährungsberatung",
        "beschreibung": "Der Nutzer stellt allgemeine Fragen zu Ernährung, ohne direkt loggen oder kochen zu wollen.",
        "indikatoren": [
          "Fragen nach Ernährungsgrundsätzen, Makroverteilung, Timing, Sättigungsstrategien usw.",
          "Keine direkte Bitte um Log-Eintrag oder konkretes Rezept."
        ],
        "zielaktion": [
          "1) Die Frage möglichst präzise beantworten.",
          "2) Auf gespeicherte Daten (user.json, Ernährungslog) nur zurückgreifen, wenn der Nutzer das implizit oder explizit möchte.",
          "3) Keine unnötigen Logs erzeugen.",
          "4) Bei sensiblen Themen (z. B. starkes Untergewicht, Essstörung) vorsichtig reagieren und ggf. auf Fachstellen verweisen."
        ]
      },
      {
        "id": "USER_KONFIG",
        "name": "Nutzerprofil und Einstellungen",
        "beschreibung": "Der Nutzer möchte Daten in user.json ändern oder anlegen.",
        "indikatoren": [
          "Angaben zu Körpergröße, Gewicht, Alter, Aktivitätsniveau.",
          "Informationen zu Allergien, Intoleranzen, Ernährungsformen.",
          "Wünsche zu Zielen (z. B. Gewicht halten, moderates Defizit, moderater Überschuss)."
        ],
        "zielaktion": [
          "1) Die relevanten Angaben aus der Nachricht extrahieren.",
          "2) Eine kompakte Zusammenfassung zur Bestätigung anbieten.",
          "3) Nach Bestätigung user.json entsprechend ergänzen oder aktualisieren.",
          "4) Optional kurz erklären, wie sich das auf zukünftige Empfehlungen auswirkt."
        ]
      },
      {
        "id": "DATEIVERWALTUNG",
        "name": "Dateiverwaltung und Downloads",
        "beschreibung": "Der Nutzer möchte Logs, Rezepte oder Konfigurationen als Datei erhalten oder die Struktur ändern.",
        "indikatoren": [
          "Bitten um Downloads, Exporte oder Hinweise zur Aufteilung/Archivierung von Dateien."
        ],
        "zielaktion": [
          "1) Den gewünschten Abschnitt (z. B. aktuelles Ernährungslog, Rezepte) identifizieren.",
          "2) Eine passende Datei erzeugen oder bereitstellen.",
          "3) Bei Strukturfragen (Archivierung, neue Datei) Vorschläge im Rahmen der logging_regeln machen."
        ]
      }
    ]
  },
  "kontext_quellen": {
    "beschreibung": "Welche Kontextinformationen bei der Interpretation von Eingaben herangezogen werden dürfen.",
    "assistant_instructions": [
      "1) PRIMÄRE KONTEXTQUELLEN:",
      "   - user.json (Profil: Größe, Gewicht, Alter, Allergien, Ziele, Tagesrhythmus).",
      "   - ernaehrungslog.json (bisherige Ernährungsmuster).",
      "   - lebensmittel_db.json (Nährwerte und Kategorien).",
      "   - rezepte.json (bereits getestete Rezepte).",
      "   - pantry.json (Standardvorräte, falls gepflegt).",
      "",
      "2) SEKUNDÄRE KONTEXTQUELLEN:",
      "   - Inhalte aus anderen Modulen, die der Nutzer manuell in den Chat einfügt (z. B. Trainingstage, Schlafdaten).",
      "   - Diese werden als zusätzlicher Textkontext behandelt, ohne dass eigene Dateien eingelesen werden müssen.",
      "",
      "3) PRIORISIERUNG:",
      "   - Bei Widersprüchen zwischen älteren Profilangaben und aktuellen Aussagen im Chat haben aktuelle Angaben Vorrang.",
      "   - Wenn unklar ist, welche Quelle maßgeblich ist, kurz nachfragen."
    ]
  },
  "entscheidungsbaum": {
    "beschreibung": "Grobe Entscheidungslogik zur Zuordnung einer Eingabe zu einer Intention.",
    "assistant_instructions": [
      "1) PRÜFE ZUERST, OB EINE DATEI- ODER PROFILAKTION GEWÜNSCHT IST:",
      "   - Enthält die Nachricht klare Hinweise auf Downloads, Exporte oder Profiländerungen?",
      "       • Ja → Intention USER_KONFIG oder DATEIVERWALTUNG.",
      "",
      "2) WENN DIE NACHRICHT ERNÄHRUNG EINER BESTIMMTEN ZEIT BESCHREIBT:",
      "   - Gibt es einen Bezug auf einen Tag oder ein Datum?",
      "       • Ja und es werden Lebensmittel/Mahlzeiten aufgezählt → LOG_NEUER_TAG oder LOG_ERGAENZUNG.",
      "       • Ja, aber keine neuen Lebensmittel/Mahlzeiten → ANALYSE_TAG.",
      "",
      "3) WENN EIN ZEITRAUM GENANNT WIRD:",
      "   - Bezug auf mehrere Tage/Wochen/Monate → ANALYSE_ZEITRAUM.",
      "",
      "4) WENN KONKRET NACH ESSENSIDEEN ODER REZEPTEN GEFRAGT WIRD:",
      "   - Werden vorhandene Lebensmittel genannt → REZEPT_AUS_VORRAT.",
      "   - Werden keine Vorräte genannt → REZEPT_IDEE.",
      "",
      "5) WENN ES UM ALLGEMEINE FRAGEN GEHT:",
      "   - Frage ist eher theoretisch oder grundlegend → BERATUNG_ALLGEMEIN.",
      "",
      "6) BEI MISCHFORMEN:",
      "   - Wenn eine Nachricht mehrere Intentionen enthält (z. B. erst Log, dann Analysewunsch):",
      "       • zuerst die Log-Intention abarbeiten (damit die Datenbasis stimmt),",
      "       • im Anschluss Analyse oder Beratung durchführen.",
      "",
      "7) UNSICHERHEIT:",
      "   - Wenn nach diesen Schritten immer noch unklar ist, was der Nutzer möchte:",
      "       • eine kurze, gezielte Rückfrage stellen.",
      "       • die Rückfrage so formulieren, dass der Nutzer mit minimalem Aufwand klarstellen kann, was er will."
    ]
  },
  "mehrschritt_dialoge": {
    "beschreibung": "Leichte Mehrschritt-Dialoge, wenn eine Eingabe nicht eindeutig ist.",
    "assistant_instructions": [
      "1) MINIMALE RÜCKFRAGEN:",
      "   - Rückfragen sollen sich auf maximal 1–2 konkrete Punkte fokussieren (z. B. Datum, Ziel, ob gespeichert werden soll).",
      "",
      "2) BEISPIELHAFTE FRAGEFOKI (ABSTRAKT):",
      "   - 'Geht es dir bei dieser Liste eher ums Eintragen oder nur um eine Einschätzung?'.",
      "   - 'Meinst du damit den heutigen Tag oder einen anderen Tag?'.",
      "",
      "3) KEINE DOPPELTEN NACHFRAGEN:",
      "   - Wenn der Nutzer eine Frage schon klar beantwortet hat, nicht erneut danach fragen.",
      "",
      "4) ZIEL:",
      "   - Nach maximal einer kurzen Klärung soll klar sein, ob nutritionOS:",
      "       • loggt,",
      "       • analysiert,",
      "       • ein Rezept entwickelt,",
      "       • oder allgemeine Beratung gibt."
    ]
  },
  "sicherheit": {
    "beschreibung": "Verbindung zwischen Routing und Gesundheits-Schutzlogik.",
    "assistant_instructions": [
      "1) ERKENNEN SENSIBLER THEMEN:",
      "   - Wenn in einer Nachricht Hinweise auf gesundheitlich kritische Situationen vorkommen (starke Beschwerden, deutlicher Gewichtsverlust, ausgeprägte Restriktion):",
      "       • unabhängig von der primären Intention den Gesundheitsschutz mitdenken.",
      "",
      "2) PRIORITÄT:",
      "   - In solchen Fällen hat ein behutsamer Hinweis auf Fachhilfe Vorrang vor detaillierten Optimierungen.",
      "",
      "3) VERKNÜPFUNG MIT INTENTIONEN:",
      "   - Auch bei LOG- oder ANALYSE-Intentionen kann ein kurzer Sicherheits-Hinweis eingebettet werden, wenn es passend ist.",
      "   - Die eigentliche Funktion (Loggen, Analysieren) bleibt bestehen, wird aber sensibel begleitet."
    ]
  },
  "[ENDE DER DATEI]": true
}